In [2]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic.shape
titanic.columns
titanic.dtypes

titanic['Age'].median()
titanic['Fare'].agg(['min','max','median', 'mean'])

titanic.Fare.describe()
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
titanic['Survived'] = titanic['Survived'].astype(int)
titanic.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [5]:
titanic.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [6]:
titanic.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [8]:
titanic.sort_values('Fare', ascending=False).head(10)['Name']

679                 Cardeza, Mr. Thomas Drake Martinez
258                                   Ward, Miss. Anna
737                             Lesurer, Mr. Gustave J
88                          Fortune, Miss. Mabel Helen
438                                  Fortune, Mr. Mark
341                     Fortune, Miss. Alice Elizabeth
27                      Fortune, Mr. Charles Alexander
742              Ryerson, Miss. Susan Parker "Suzette"
311                         Ryerson, Miss. Emily Borie
299    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
Name: Name, dtype: object

In [9]:
titanic['FamilySize'] = titanic['SibSp'] + titanic['Parch'] + 1
titanic[['FamilySize', 'Survived']].corr()

            FamilySize  Survived
FamilySize    1.000000  0.016639
Survived      0.016639  1.000000

In [15]:

titanic.groupby(['Pclass', 'Age'])['Survived'].mean().head()
# when using groupby, you use same syntax as if you were doing titanic['column_name'] - each group is a dataframe

Pclass  Age
1       0.92     1.0
        2.00     0.0
        4.00     1.0
        11.00    1.0
        14.00    1.0
Name: Survived, dtype: float64

In [16]:
titanic.groupby(['Embarked', 'Pclass'])['Fare'].describe()

                 count        mean        std      min      25%      50%  \
Embarked Pclass
C        1        85.0  104.718529  99.093935  26.5500  49.5000  78.2667
         2        17.0   25.358335  11.345067  12.0000  13.8625  24.0000
         3        66.0   11.214083   4.871528   4.0125   7.2292   7.8958
Q        1         2.0   90.000000   0.000000  90.0000  90.0000  90.0000
         2         3.0   12.350000   0.000000  12.3500  12.3500  12.3500
         3        72.0   11.183393   6.721677   6.7500   7.7500   7.7500
S        1       127.0   70.364862  58.811278   0.0000  29.2500  52.0000
         2       164.0   20.327439  13.630741   0.0000  13.0000  13.5000
         3       353.0   14.644083  13.276609   0.0000   7.8542   8.0500

                        75%       max
Embarked Pclass
C        1       110.883300  512.3292
         2        37.004200   41.5792
         3        14.458300   22.3583
Q        1        90.000000   90.0000
         2        12.350000   12.3500
         3        10.218725   29.1250
S        1        83.475000  263.0000
         2        26.000000   73.5000
         3        16.100000   69.5500

In [20]:
titanic.assign(Fare_per_person = titanic['Fare'] / titanic['FamilySize']).sort_values('Fare_per_person', ascending=False).head(1)['Name']

737    Lesurer, Mr. Gustave J
Name: Name, dtype: object